In [3]:
import numpy as np
import pandas as pd

In [4]:
#index levels
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [5]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [6]:
inside

[1, 2, 3, 1, 2, 3]

In [7]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['akshat','atharv','shobhit','adrit','adya','anvika'],
     'Sales':[900,840,700,988,999,555]}

In [8]:
df=pd.DataFrame(data)

In [9]:
df

  Company   Person  Sales
0    GOOG   akshat    900
1    GOOG   atharv    840
2    MSFT  shobhit    700
3    MSFT    adrit    988
4      FB     adya    999
5      FB   anvika    555

In [10]:
bycomp=df.groupby('Company')

In [11]:
bycomp

In [12]:
bycomp.mean('Sales')

         Sales
Company
FB       777.0
GOOG     870.0
MSFT     844.0

In [13]:
bycomp.sum()

/tmp/ipykernel_1951/2439611464.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  bycomp.sum()

         Sales
Company
FB        1554
GOOG      1740
MSFT      1688

In [14]:
bycomp.std()

/tmp/ipykernel_1951/1699478501.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  bycomp.std()

              Sales
Company
FB       313.955411
GOOG      42.426407
MSFT     203.646753

In [15]:
#multiple commands only in 1 statement
df.groupby('Company').sum().loc['FB']

/tmp/ipykernel_1951/667635135.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').sum().loc['FB']

Sales    1554
Name: FB, dtype: int64

In [16]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [17]:
df.groupby('Company').max()

          Person  Sales
Company
FB        anvika    999
GOOG      atharv    900
MSFT     shobhit    988

In [18]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   777.000000  870.000000  844.000000
      std    313.955411   42.426407  203.646753
      min    555.000000  840.000000  700.000000
      25%    666.000000  855.000000  772.000000
      50%    777.000000  870.000000  844.000000
      75%    888.000000  885.000000  916.000000
      max    999.000000  900.000000  988.000000

In [19]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

In [20]:
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [21]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [22]:
left=pd.DataFrame({'key1':['K0','K0','K1','K2'],
                   'key2':['K0','K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

In [23]:
right=pd.DataFrame({'key1':['K0','K1','K1','K2'],
                   'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [24]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [25]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [26]:
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [27]:
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [28]:
df['col2'].unique()

array([444, 555, 666])

In [29]:
df['col2'].nunique()

3

In [30]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [31]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [32]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [33]:
def times2(x):
    return x*2

In [34]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [35]:
df['col3']

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [36]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [37]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [38]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [39]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [40]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [41]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [42]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [43]:
data={'A':['roo','roo','roo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]}

In [45]:
df=pd.DataFrame(data)

In [46]:
df

     A    B  C  D
0  roo  one  x  1
1  roo  one  y  3
2  roo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [47]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
roo one  1.0  3.0
    two  2.0  NaN